Revit 2027 API
MaterialPropertyPathType Enumeration
 Enum class indicating kinds of paths which ExternalFileReferenceType.Material references can have.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MaterialPropertyPathType
Public Enumeration MaterialPropertyPathType
public enum class MaterialPropertyPathType
type MaterialPropertyPathType
Members
Member name | Value | Description
Bump | 3 |  Bump pattern, for generic materials
Cutouts | 2 |  Cutouts image, for generic or metal materials
FinishBumps | 4 |  Finish bumps, pattern for various material types
General | 0 |  General image, for various material types
ReliefPattern | 5 |  Relief pattern, for various material types
Transparency | 1 |  Transparency image, for generic materials
Weathering | 6 |  Weathering image, for concrete materials
See Also
Reference
Autodesk.Revit.DB Namespace